umrsraj/Nordic-nrf52840-/ble with both uartes working code/main.c
    memset(&init, 0, sizeof(init));

    init.advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance = false;
    init.advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

    init.srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.srdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;
    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
//static void buttons_leds_init(bool * p_erase_bonds)
//{
//    bsp_event_t startup_event;

//    uint32_t err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
//    APP_ERROR_CHECK(err_code);

//    err_code = bsp_btn_ble_init(NULL, &startup_event);
//    APP_ERROR_CHECK(err_code);

//    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
//}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    UNUSED_RETURN_VALUE(NRF_LOG_PROCESS());
    nrf_pwr_mgmt_run();
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
}

//********************************************************************************************************
void sendSerial (char * sdata, uint8_t len)
{
   ret_code_t ret;
   ret = nrf_serial_write(&serial1_uarte,
                           sdata,
                           len,
                           NULL,
                           NRF_SERIAL_MAX_TIMEOUT);                           
  APP_ERROR_CHECK(ret);
  nrf_delay_ms(2);
  
}

void readVitals()    // to read all the vital parameters from birdmeditech
{
  char read_vitals[8] = {DEVICE_ADDR, FC_READ, 0x00, 0x00, 0x00, 0x04, 0x44, 0x09};
  nrf_gpio_pin_write(rs485_DE, 1); //for sending (1/0-HIGH/LOW)
  nrf_delay_ms(10);
  sendSerial(read_vitals, 8);
  nrf_gpio_pin_write(rs485_DE, 0); //for receiving
  nrf_delay_ms(10);
}

//********************************************************************************************************

/**@brief Application main function.
 */
int main(void)
      {
bool erase_bonds;

    // Initialize.
   // uart_init();
    log_init();
    timers_init();
   // buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();

    // Start execution.
   // printf("\r\nUART started.\r\n");
    NRF_LOG_INFO("Debug logging for UART over RTT started.");
    advertising_start();
    //printf("start of serial_uartes\n");

    nrf_gpio_cfg_output(rs485_DE);
  nrf_gpio_cfg_output(rs485_RE);
  nrf_gpio_cfg_output(LED);

//|*********************************************************************************************************
 ret_code_t ret;

    //ret = nrf_drv_clock_init();
    //APP_ERROR_CHECK(ret);
    //ret = nrf_drv_power_init(NULL);
    //APP_ERROR_CHECK(ret);

    nrf_drv_clock_lfclk_request(NULL);
    ret = app_timer_init();
    APP_ERROR_CHECK(ret);

    // Initialize LEDs and buttons.
    //bsp_board_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS);

    //printf("Hello world \n");

    ret = nrf_serial_init(&serial0_uarte, &m_uarte0_drv_config, &serial0_config);
    APP_ERROR_CHECK(ret);

    ret = nrf_serial_init(&serial1_uarte, &m_uarte1_drv_config, &serial1_config);
    APP_ERROR_CHECK(ret);

    static char tx_message[] = "Hello nrf_serial!\n";

    static char port0_message[] = "port-0 message\n";

    ret = nrf_serial_write(&serial1_uarte,
                           tx_message,
                           strlen(tx_message),
                           NULL,
                           NRF_SERIAL_MAX_TIMEOUT);

 ret = nrf_serial_write(&serial0_uarte,
                           tx_message,
                           strlen(tx_message),
                           NULL,
                           NRF_SERIAL_MAX_TIMEOUT);
//|*************************************************************************************************************



    // Enter main loop.
    for (;;)
    {
    nrf_delay_ms(2000);
       uint8_t buff[256];
  memset(&buff, NULL, 256);
  //{"DID":"SBWXXX","MID":"201","AT":"23.4","BT":"25.6","PT":"35.6","WT":"+30.535", "HT:"100"}
  sprintf(buff, "{\"DID\":\"SBWXXX\",\"MID\":\"201\",\"AT\":\"2.1f\",\"BT\":\"2.1f\",\"PT\":\"2.1f\",\"WT\":\".3f\",\"HT\":\"2f\"}\n");
  uint16_t length = (uint16_t)strlen(buff);
  ble_nus_data_send(&m_nus, buff, &length, m_conn_handle);
  nrf_delay_ms(500);
   ret = nrf_serial_write(&serial1_uarte,
                           tx_message,
                           strlen(tx_message),
                           NULL,
                           NRF_SERIAL_MAX_TIMEOUT);

                           nrf_delay_ms(500);
//readVitals();
       
       // idle_state_handle();
    }
}


/**
 * @}
 */
